
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/2547333d-2f60-4ba9-a9b6-72194d80389e/terraform-bin plan -no-color
2024-04-21T08:33:53.273Z [INFO]  Terraform version: 1.8.1
2024-04-21T08:33:53.273Z [INFO]  Go runtime version: go1.22.1
2024-04-21T08:33:53.273Z [INFO]  CLI args: []string{"/home/runner/work/_temp/2547333d-2f60-4ba9-a9b6-72194d80389e/terraform-bin", "plan", "-no-color"}
2024-04-21T08:33:53.274Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-04-21T08:33:53.277Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=5c2f5402-88f4-a344-2a3e-bcca1305ca0f tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-04-21T08:33:53.848Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=5c2f5402-88f4-a344-2a3e-bcca1305ca0f tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate
2024-04-21T08:33:53.986Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=5c2f5402-88f4-a344-2a3e-bcca1305ca0f tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate
2024-04-21T08:33:54.324Z [INFO]  backend/local: starting Plan operation
2024-04-21T08:33:54.919Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=1dc92a91-252e-1b2b-3ad2-1afb7c983614 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate
2024-04-21T08:33:55.063Z [INFO]  provider: configuring client automatic mTLS
2024-04-21T08:33:55.152Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-21T08:33:55.152Z
2024-04-21T08:33:55.837Z [INFO]  provider: configuring client automatic mTLS
2024-04-21T08:33:55.923Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-21T08:33:55.923Z
2024-04-21T08:33:56.049Z [INFO]  backend/local: plan calling Plan
2024-04-21T08:33:56.050Z [INFO]  provider: configuring client automatic mTLS
2024-04-21T08:33:56.135Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-21T08:33:56.135Z
2024-04-21T08:33:56.246Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=b5af0055-4fb1-f0af-4362-151be779bdf0 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 tf_mux_provider="*schema.GRPCProviderServer" timestamp=2024-04-21T08:33:56.246Z
2024-04-21T08:33:56.813Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=b5af0055-4fb1-f0af-4362-151be779bdf0 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 tf_mux_provider="*schema.GRPCProviderServer" tf_rpc=ConfigureProvider timestamp=2024-04-21T08:33:56.813Z
2024-04-21T08:33:56.822Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
2024-04-21T08:33:56.829Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.algosolved_repository will be created
  + resource "aws_ecr_repository" "algosolved_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "algosolved"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Name"  = "algosolved"
          + "Stage" = "prod"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecr_repository.algosolved_repository will be created%0A  + resource "aws_ecr_repository" "algosolved_repository" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "algosolved"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = {%0A          + "Name"  = "algosolved"%0A          + "Stage" = "prod"%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-04-21T08:33:53.273Z [INFO]  Terraform version: 1.8.1%0A2024-04-21T08:33:53.273Z [INFO]  Go runtime version: go1.22.1%0A2024-04-21T08:33:53.273Z [INFO]  CLI args: []string{"/home/runner/work/_temp/2547333d-2f60-4ba9-a9b6-72194d80389e/terraform-bin", "plan", "-no-color"}%0A2024-04-21T08:33:53.274Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-04-21T08:33:53.277Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=5c2f5402-88f4-a344-2a3e-bcca1305ca0f tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-04-21T08:33:53.848Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=5c2f5402-88f4-a344-2a3e-bcca1305ca0f tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate%0A2024-04-21T08:33:53.986Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=5c2f5402-88f4-a344-2a3e-bcca1305ca0f tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate%0A2024-04-21T08:33:54.324Z [INFO]  backend/local: starting Plan operation%0A2024-04-21T08:33:54.919Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=1dc92a91-252e-1b2b-3ad2-1afb7c983614 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=prod/terraform.tfstate%0A2024-04-21T08:33:55.063Z [INFO]  provider: configuring client automatic mTLS%0A2024-04-21T08:33:55.152Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-21T08:33:55.152Z%0A2024-04-21T08:33:55.837Z [INFO]  provider: configuring client automatic mTLS%0A2024-04-21T08:33:55.923Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-21T08:33:55.923Z%0A2024-04-21T08:33:56.049Z [INFO]  backend/local: plan calling Plan%0A2024-04-21T08:33:56.050Z [INFO]  provider: configuring client automatic mTLS%0A2024-04-21T08:33:56.135Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-04-21T08:33:56.135Z%0A2024-04-21T08:33:56.246Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=b5af0055-4fb1-f0af-4362-151be779bdf0 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 tf_mux_provider="*schema.GRPCProviderServer" timestamp=2024-04-21T08:33:56.246Z%0A2024-04-21T08:33:56.813Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=b5af0055-4fb1-f0af-4362-151be779bdf0 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 tf_mux_provider="*schema.GRPCProviderServer" tf_rpc=ConfigureProvider timestamp=2024-04-21T08:33:56.813Z%0A2024-04-21T08:33:56.822Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A2024-04-21T08:33:56.829Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```

</details>




**Pusher: @rha6780**